src/SteadyState/Inlet-Outlet/setups.orig/common/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

kappa                0.40;
Cmu                  0.09;
flowDir              (1 0 0);
zDir                 (0 0 1);
Uref                 3.5;          
Zref                 1.0;          
z0                   uniform 0.028;  
d                    uniform 0.0;


// ************************************************************************* //
