src/SteadyState/Inlet-Outlet/setups.orig/common/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication decomposePar

runParallel setFields

runParallel $(getApplication)

runApplication reconstructPar

runApplication foamToVTK

#------------------------------------------------------------------------------
