src/SteadyState/Inlet-Outlet/setups.orig/common/system/EPMParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

const startiteration = 0;     //For temporal solver - iteration to commence evaporation
const scalar& Hr = 30;        //Ambient radiation
const scalar& T_ground = 284; //Ground temperature
const scalar& cd = 0.2;       //Canopy drag coefficent
const scalar& cp = 1.005e3;   //Specific heat capacity
const scalar& lmb = 2.25e6;   //Latent heat of vapourisation
const scalar& H = 20;         //Canopy Height (To update to read automatically)
const scalar& psy = 66;       //Psychrometric constant
const scalar& Rspec = 461.5;  //Specific gas constant
const scalar& kappa = 0.4;    //von Karman constant
const scalar& RH = 0.9;       //Background relative humidity 

// ************************************************************************* //
