src/SteadyState/Inlet-Outlet/setups.orig/common/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.1;
    }

    "(U|k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.1;
    }
    
    "T|Moisture"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent               true;
    pRefCell                 0;
    pRefValue                0;
}

relaxationFactors
{
    fields
    {
    p_rgh		     0.5;
    }
    
    equations
    {
        U                    0.6;
        "(k|epsilon|omega)"  0.6;
        T                    0.6;
        p_rgh                0.5;
        Moisture	     0.5;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
